Revit 2024 API
IFCFamilyInstanceExtrusionExportResults Methods
The IFCFamilyInstanceExtrusionExportResults type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCutPairOpenings
 Gets the set of "openings" determined from the analysis of the instance geometry.
GetExtrusionHandle
 Gets the extruded solid handle generated for the family instance.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace